TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_ipc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCMIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU1TOCMIPCFLG_IPC0    0x1U          // CPU1 to CM IPC0 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC1    0x2U          // CPU1 to CM IPC1 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC2    0x4U          // CPU1 to CM IPC2 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC3    0x8U          // CPU1 to CM IPC3 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC4    0x10U         // CPU1 to CM IPC4 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC5    0x20U         // CPU1 to CM IPC5 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC6    0x40U         // CPU1 to CM IPC6 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC7    0x80U         // CPU1 to CM IPC7 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC8    0x100U        // CPU1 to CM IPC8 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC9    0x200U        // CPU1 to CM IPC9 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC10   0x400U        // CPU1 to CM IPC10 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC11   0x800U        // CPU1 to CM IPC11 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC12   0x1000U       // CPU1 to CM IPC12 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC13   0x2000U       // CPU1 to CM IPC13 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC14   0x4000U       // CPU1 to CM IPC14 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC15   0x8000U       // CPU1 to CM IPC15 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC16   0x10000U      // CPU1 to CM IPC16 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC17   0x20000U      // CPU1 to CM IPC17 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC18   0x40000U      // CPU1 to CM IPC18 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC19   0x80000U      // CPU1 to CM IPC19 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC20   0x100000U     // CPU1 to CM IPC20 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC21   0x200000U     // CPU1 to CM IPC21 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC22   0x400000U     // CPU1 to CM IPC22 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC23   0x800000U     // CPU1 to CM IPC23 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC24   0x1000000U    // CPU1 to CM IPC24 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC25   0x2000000U    // CPU1 to CM IPC25 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC26   0x4000000U    // CPU1 to CM IPC26 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC27   0x8000000U    // CPU1 to CM IPC27 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC28   0x10000000U   // CPU1 to CM IPC28 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC29   0x20000000U   // CPU1 to CM IPC29 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC30   0x40000000U   // CPU1 to CM IPC30 Flag Status
#define IPC_CPU1TOCMIPCFLG_IPC31   0x80000000U   // CPU1 to CM IPC31 Flag Status


//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1IPCACK register
//
//*************************************************************************************************
#define IPC_CMTOCPU1IPCACK_IPC0    0x1U          // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC0
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC1    0x2U          // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC1
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC2    0x4U          // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC2
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC3    0x8U          // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC3
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC4    0x10U         // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC4
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC5    0x20U         // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC5
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC6    0x40U         // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC6
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC7    0x80U         // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC7
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC8    0x100U        // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC8
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC9    0x200U        // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC9
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC10   0x400U        // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC10
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC11   0x800U        // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC11
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC12   0x1000U       // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC12
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC13   0x2000U       // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC13
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC14   0x4000U       // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC14
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC15   0x8000U       // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC15
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC16   0x10000U      // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC16
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC17   0x20000U      // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC17
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC18   0x40000U      // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC18
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC19   0x80000U      // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC19
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC20   0x100000U     // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC20
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC21   0x200000U     // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC21
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC22   0x400000U     // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC22
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC23   0x800000U     // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC23
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC24   0x1000000U    // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC24
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC25   0x2000000U    // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC25
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC26   0x4000000U    // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC26
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC27   0x8000000U    // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC27
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC28   0x10000000U   // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC28
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC29   0x20000000U   // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC29
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC30   0x40000000U   // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC30
                                                 // bit
#define IPC_CMTOCPU1IPCACK_IPC31   0x80000000U   // Acknowledgement from CM to CPU1TOCMIPCFLG.IPC31
                                                 // bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCMIPCSTS register
//
//*************************************************************************************************
#define IPC_CPU1TOCMIPCSTS_IPC0    0x1U          // IPC0 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC1    0x2U          // IPC1 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC2    0x4U          // IPC2 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC3    0x8U          // IPC3 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC4    0x10U         // IPC4 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC5    0x20U         // IPC5 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC6    0x40U         // IPC6 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC7    0x80U         // IPC7 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC8    0x100U        // IPC8 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC9    0x200U        // IPC9 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC10   0x400U        // IPC10 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC11   0x800U        // IPC11 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC12   0x1000U       // IPC12 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC13   0x2000U       // IPC13 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC14   0x4000U       // IPC14 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC15   0x8000U       // IPC15 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC16   0x10000U      // IPC16 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC17   0x20000U      // IPC17 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC18   0x40000U      // IPC18 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC19   0x80000U      // IPC19 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC20   0x100000U     // IPC20 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC21   0x200000U     // IPC21 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC22   0x400000U     // IPC22 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC23   0x800000U     // IPC23 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC24   0x1000000U    // IPC24 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC25   0x2000000U    // IPC25 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC26   0x4000000U    // IPC26 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC27   0x8000000U    // IPC27 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC28   0x10000000U   // IPC28 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC29   0x20000000U   // IPC29 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC30   0x40000000U   // IPC30 Request from  CPU1 to CM
#define IPC_CPU1TOCMIPCSTS_IPC31   0x80000000U   // IPC31 Request from  CPU1 to CM

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1IPCSET register
//
//*************************************************************************************************
#define IPC_CMTOCPU1IPCSET_IPC0    0x1U          // Set CMTOCPU1IPCFLG.IPC0 Flag
#define IPC_CMTOCPU1IPCSET_IPC1    0x2U          // Set CMTOCPU1IPCFLG.IPC1 Flag
#define IPC_CMTOCPU1IPCSET_IPC2    0x4U          // Set CMTOCPU1IPCFLG.IPC2 Flag
#define IPC_CMTOCPU1IPCSET_IPC3    0x8U          // Set CMTOCPU1IPCFLG.IPC3 Flag
#define IPC_CMTOCPU1IPCSET_IPC4    0x10U         // Set CMTOCPU1IPCFLG.IPC4 Flag
#define IPC_CMTOCPU1IPCSET_IPC5    0x20U         // Set CMTOCPU1IPCFLG.IPC5 Flag
#define IPC_CMTOCPU1IPCSET_IPC6    0x40U         // Set CMTOCPU1IPCFLG.IPC6 Flag
#define IPC_CMTOCPU1IPCSET_IPC7    0x80U         // Set CMTOCPU1IPCFLG.IPC7 Flag
#define IPC_CMTOCPU1IPCSET_IPC8    0x100U        // Set CMTOCPU1IPCFLG.IPC8 Flag
#define IPC_CMTOCPU1IPCSET_IPC9    0x200U        // Set CMTOCPU1IPCFLG.IPC9 Flag
#define IPC_CMTOCPU1IPCSET_IPC10   0x400U        // Set CMTOCPU1IPCFLG.IPC10 Flag
#define IPC_CMTOCPU1IPCSET_IPC11   0x800U        // Set CMTOCPU1IPCFLG.IPC11 Flag
#define IPC_CMTOCPU1IPCSET_IPC12   0x1000U       // Set CMTOCPU1IPCFLG.IPC12 Flag
#define IPC_CMTOCPU1IPCSET_IPC13   0x2000U       // Set CMTOCPU1IPCFLG.IPC13 Flag
#define IPC_CMTOCPU1IPCSET_IPC14   0x4000U       // Set CMTOCPU1IPCFLG.IPC14 Flag
#define IPC_CMTOCPU1IPCSET_IPC15   0x8000U       // Set CMTOCPU1IPCFLG.IPC15 Flag
#define IPC_CMTOCPU1IPCSET_IPC16   0x10000U      // Set CMTOCPU1IPCFLG.IPC16 Flag
#define IPC_CMTOCPU1IPCSET_IPC17   0x20000U      // Set CMTOCPU1IPCFLG.IPC17 Flag
#define IPC_CMTOCPU1IPCSET_IPC18   0x40000U      // Set CMTOCPU1IPCFLG.IPC18 Flag
#define IPC_CMTOCPU1IPCSET_IPC19   0x80000U      // Set CMTOCPU1IPCFLG.IPC19 Flag
#define IPC_CMTOCPU1IPCSET_IPC20   0x100000U     // Set CMTOCPU1IPCFLG.IPC20 Flag
#define IPC_CMTOCPU1IPCSET_IPC21   0x200000U     // Set CMTOCPU1IPCFLG.IPC21 Flag
#define IPC_CMTOCPU1IPCSET_IPC22   0x400000U     // Set CMTOCPU1IPCFLG.IPC22 Flag
#define IPC_CMTOCPU1IPCSET_IPC23   0x800000U     // Set CMTOCPU1IPCFLG.IPC23 Flag
#define IPC_CMTOCPU1IPCSET_IPC24   0x1000000U    // Set CMTOCPU1IPCFLG.IPC24 Flag
#define IPC_CMTOCPU1IPCSET_IPC25   0x2000000U    // Set CMTOCPU1IPCFLG.IPC25 Flag
#define IPC_CMTOCPU1IPCSET_IPC26   0x4000000U    // Set CMTOCPU1IPCFLG.IPC26 Flag
#define IPC_CMTOCPU1IPCSET_IPC27   0x8000000U    // Set CMTOCPU1IPCFLG.IPC27 Flag
#define IPC_CMTOCPU1IPCSET_IPC28   0x10000000U   // Set CMTOCPU1IPCFLG.IPC28 Flag
#define IPC_CMTOCPU1IPCSET_IPC29   0x20000000U   // Set CMTOCPU1IPCFLG.IPC29 Flag
#define IPC_CMTOCPU1IPCSET_IPC30   0x40000000U   // Set CMTOCPU1IPCFLG.IPC30 Flag
#define IPC_CMTOCPU1IPCSET_IPC31   0x80000000U   // Set CMTOCPU1IPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1IPCCLR register
//
//*************************************************************************************************
#define IPC_CMTOCPU1IPCCLR_IPC0    0x1U          // Clear CMTOCPU1IPCFLG.IPC0 Flag
#define IPC_CMTOCPU1IPCCLR_IPC1    0x2U          // Clear CMTOCPU1IPCFLG.IPC1 Flag
#define IPC_CMTOCPU1IPCCLR_IPC2    0x4U          // Clear CMTOCPU1IPCFLG.IPC2 Flag
#define IPC_CMTOCPU1IPCCLR_IPC3    0x8U          // Clear CMTOCPU1IPCFLG.IPC3 Flag
#define IPC_CMTOCPU1IPCCLR_IPC4    0x10U         // Clear CMTOCPU1IPCFLG.IPC4 Flag
#define IPC_CMTOCPU1IPCCLR_IPC5    0x20U         // Clear CMTOCPU1IPCFLG.IPC5 Flag
#define IPC_CMTOCPU1IPCCLR_IPC6    0x40U         // Clear CMTOCPU1IPCFLG.IPC6 Flag
#define IPC_CMTOCPU1IPCCLR_IPC7    0x80U         // Clear CMTOCPU1IPCFLG.IPC7 Flag
#define IPC_CMTOCPU1IPCCLR_IPC8    0x100U        // Clear CMTOCPU1IPCFLG.IPC8 Flag
#define IPC_CMTOCPU1IPCCLR_IPC9    0x200U        // Clear CMTOCPU1IPCFLG.IPC9 Flag
#define IPC_CMTOCPU1IPCCLR_IPC10   0x400U        // Clear CMTOCPU1IPCFLG.IPC10 Flag
#define IPC_CMTOCPU1IPCCLR_IPC11   0x800U        // Clear CMTOCPU1IPCFLG.IPC11 Flag
#define IPC_CMTOCPU1IPCCLR_IPC12   0x1000U       // Clear CMTOCPU1IPCFLG.IPC12 Flag
#define IPC_CMTOCPU1IPCCLR_IPC13   0x2000U       // Clear CMTOCPU1IPCFLG.IPC13 Flag
#define IPC_CMTOCPU1IPCCLR_IPC14   0x4000U       // Clear CMTOCPU1IPCFLG.IPC14 Flag
#define IPC_CMTOCPU1IPCCLR_IPC15   0x8000U       // Clear CMTOCPU1IPCFLG.IPC15 Flag
#define IPC_CMTOCPU1IPCCLR_IPC16   0x10000U      // Clear CMTOCPU1IPCFLG.IPC16 Flag
#define IPC_CMTOCPU1IPCCLR_IPC17   0x20000U      // Clear CMTOCPU1IPCFLG.IPC17 Flag
#define IPC_CMTOCPU1IPCCLR_IPC18   0x40000U      // Clear CMTOCPU1IPCFLG.IPC18 Flag
#define IPC_CMTOCPU1IPCCLR_IPC19   0x80000U      // Clear CMTOCPU1IPCFLG.IPC19 Flag
#define IPC_CMTOCPU1IPCCLR_IPC20   0x100000U     // Clear CMTOCPU1IPCFLG.IPC20 Flag
#define IPC_CMTOCPU1IPCCLR_IPC21   0x200000U     // Clear CMTOCPU1IPCFLG.IPC21 Flag
#define IPC_CMTOCPU1IPCCLR_IPC22   0x400000U     // Clear CMTOCPU1IPCFLG.IPC22 Flag
#define IPC_CMTOCPU1IPCCLR_IPC23   0x800000U     // Clear CMTOCPU1IPCFLG.IPC23 Flag
#define IPC_CMTOCPU1IPCCLR_IPC24   0x1000000U    // Clear CMTOCPU1IPCFLG.IPC24 Flag
#define IPC_CMTOCPU1IPCCLR_IPC25   0x2000000U    // Clear CMTOCPU1IPCFLG.IPC25 Flag
#define IPC_CMTOCPU1IPCCLR_IPC26   0x4000000U    // Clear CMTOCPU1IPCFLG.IPC26 Flag
#define IPC_CMTOCPU1IPCCLR_IPC27   0x8000000U    // Clear CMTOCPU1IPCFLG.IPC27 Flag
#define IPC_CMTOCPU1IPCCLR_IPC28   0x10000000U   // Clear CMTOCPU1IPCFLG.IPC28 Flag
#define IPC_CMTOCPU1IPCCLR_IPC29   0x20000000U   // Clear CMTOCPU1IPCFLG.IPC29 Flag
#define IPC_CMTOCPU1IPCCLR_IPC30   0x40000000U   // Clear CMTOCPU1IPCFLG.IPC30 Flag
#define IPC_CMTOCPU1IPCCLR_IPC31   0x80000000U   // Clear CMTOCPU1IPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1IPCFLG register
//
//*************************************************************************************************
#define IPC_CMTOCPU1IPCFLG_IPC0    0x1U          // CM to CPU1 IPC0 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC1    0x2U          // CM to CPU1 IPC1 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC2    0x4U          // CM to CPU1 IPC2 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC3    0x8U          // CM to CPU1 IPC3 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC4    0x10U         // CM to CPU1 IPC4 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC5    0x20U         // CM to CPU1 IPC5 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC6    0x40U         // CM to CPU1 IPC6 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC7    0x80U         // CM to CPU1 IPC7 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC8    0x100U        // CM to CPU1 IPC8 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC9    0x200U        // CM to CPU1 IPC9 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC10   0x400U        // CM to CPU1 IPC10 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC11   0x800U        // CM to CPU1 IPC11 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC12   0x1000U       // CM to CPU1 IPC12 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC13   0x2000U       // CM to CPU1 IPC13 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC14   0x4000U       // CM to CPU1 IPC14 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC15   0x8000U       // CM to CPU1 IPC15 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC16   0x10000U      // CM to CPU1 IPC16 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC17   0x20000U      // CM to CPU1 IPC17 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC18   0x40000U      // CM to CPU1 IPC18 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC19   0x80000U      // CM to CPU1 IPC19 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC20   0x100000U     // CM to CPU1 IPC20 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC21   0x200000U     // CM to CPU1 IPC21 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC22   0x400000U     // CM to CPU1 IPC22 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC23   0x800000U     // CM to CPU1 IPC23 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC24   0x1000000U    // CM to CPU1 IPC24 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC25   0x2000000U    // CM to CPU1 IPC25 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC26   0x4000000U    // CM to CPU1 IPC26 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC27   0x8000000U    // CM to CPU1 IPC27 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC28   0x10000000U   // CM to CPU1 IPC28 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC29   0x20000000U   // CM to CPU1 IPC29 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC30   0x40000000U   // CM to CPU1 IPC30 Flag Status
#define IPC_CMTOCPU1IPCFLG_IPC31   0x80000000U   // CM to CPU1 IPC31 Flag Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the PUMPREQUEST register
//
//*************************************************************************************************
#define IPC_PUMPREQUEST_SEM_S   0U
#define IPC_PUMPREQUEST_SEM_M   0x3U          // Flash Pump Request Semaphore between CPU1, CPU2
                                              // and CM
#define IPC_PUMPREQUEST_KEY_S   16U
#define IPC_PUMPREQUEST_KEY_M   0xFFFF0000U   // Key Qualifier for writes to this register


