TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_ipc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCMIPCACK register
//
//*************************************************************************************************
#define IPC_CPU2TOCMIPCACK_IPC0    0x1U          // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC0 bit
#define IPC_CPU2TOCMIPCACK_IPC1    0x2U          // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC1 bit
#define IPC_CPU2TOCMIPCACK_IPC2    0x4U          // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC2 bit
#define IPC_CPU2TOCMIPCACK_IPC3    0x8U          // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC3 bit
#define IPC_CPU2TOCMIPCACK_IPC4    0x10U         // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC4 bit
#define IPC_CPU2TOCMIPCACK_IPC5    0x20U         // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC5 bit
#define IPC_CPU2TOCMIPCACK_IPC6    0x40U         // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC6 bit
#define IPC_CPU2TOCMIPCACK_IPC7    0x80U         // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC7 bit
#define IPC_CPU2TOCMIPCACK_IPC8    0x100U        // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC8 bit
#define IPC_CPU2TOCMIPCACK_IPC9    0x200U        // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC9 bit
#define IPC_CPU2TOCMIPCACK_IPC10   0x400U        // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC10 bit
#define IPC_CPU2TOCMIPCACK_IPC11   0x800U        // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC11 bit
#define IPC_CPU2TOCMIPCACK_IPC12   0x1000U       // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC12 bit
#define IPC_CPU2TOCMIPCACK_IPC13   0x2000U       // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC13 bit
#define IPC_CPU2TOCMIPCACK_IPC14   0x4000U       // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC14 bit
#define IPC_CPU2TOCMIPCACK_IPC15   0x8000U       // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC15 bit
#define IPC_CPU2TOCMIPCACK_IPC16   0x10000U      // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC16 bit
#define IPC_CPU2TOCMIPCACK_IPC17   0x20000U      // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC17 bit
#define IPC_CPU2TOCMIPCACK_IPC18   0x40000U      // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC18 bit
#define IPC_CPU2TOCMIPCACK_IPC19   0x80000U      // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC19 bit
#define IPC_CPU2TOCMIPCACK_IPC20   0x100000U     // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC20 bit
#define IPC_CPU2TOCMIPCACK_IPC21   0x200000U     // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC21 bit
#define IPC_CPU2TOCMIPCACK_IPC22   0x400000U     // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC22 bit
#define IPC_CPU2TOCMIPCACK_IPC23   0x800000U     // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC23 bit
#define IPC_CPU2TOCMIPCACK_IPC24   0x1000000U    // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC24 bit
#define IPC_CPU2TOCMIPCACK_IPC25   0x2000000U    // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC25 bit
#define IPC_CPU2TOCMIPCACK_IPC26   0x4000000U    // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC26 bit
#define IPC_CPU2TOCMIPCACK_IPC27   0x8000000U    // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC27 bit
#define IPC_CPU2TOCMIPCACK_IPC28   0x10000000U   // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC28 bit
#define IPC_CPU2TOCMIPCACK_IPC29   0x20000000U   // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC29 bit
#define IPC_CPU2TOCMIPCACK_IPC30   0x40000000U   // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC30 bit
#define IPC_CPU2TOCMIPCACK_IPC31   0x80000000U   // Acknowledgement from CPU2 to
                                                 // CMTOCPU2IPCFLG.IPC31 bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU2IPCSTS register
//
//*************************************************************************************************
#define IPC_CMTOCPU2IPCSTS_IPC0    0x1U          // IPC0 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC1    0x2U          // IPC1 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC2    0x4U          // IPC2 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC3    0x8U          // IPC3 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC4    0x10U         // IPC4 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC5    0x20U         // IPC5 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC6    0x40U         // IPC6 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC7    0x80U         // IPC7 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC8    0x100U        // IPC8 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC9    0x200U        // IPC9 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC10   0x400U        // IPC10 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC11   0x800U        // IPC11 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC12   0x1000U       // IPC12 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC13   0x2000U       // IPC13 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC14   0x4000U       // IPC14 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC15   0x8000U       // IPC15 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC16   0x10000U      // IPC16 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC17   0x20000U      // IPC17 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC18   0x40000U      // IPC18 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC19   0x80000U      // IPC19 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC20   0x100000U     // IPC20 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC21   0x200000U     // IPC21 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC22   0x400000U     // IPC22 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC23   0x800000U     // IPC23 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC24   0x1000000U    // IPC24 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC25   0x2000000U    // IPC25 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC26   0x4000000U    // IPC26 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC27   0x8000000U    // IPC27 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC28   0x10000000U   // IPC28 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC29   0x20000000U   // IPC29 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC30   0x40000000U   // IPC30 Request from  CM to CPU2
#define IPC_CMTOCPU2IPCSTS_IPC31   0x80000000U   // IPC31 Request from  CM to CPU2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCMIPCSET register
//
//*************************************************************************************************
#define IPC_CPU2TOCMIPCSET_IPC0    0x1U          // Set CPU2TOCMIPCFLG.IPC0 Flag
#define IPC_CPU2TOCMIPCSET_IPC1    0x2U          // Set CPU2TOCMIPCFLG.IPC1 Flag
#define IPC_CPU2TOCMIPCSET_IPC2    0x4U          // Set CPU2TOCMIPCFLG.IPC2 Flag
#define IPC_CPU2TOCMIPCSET_IPC3    0x8U          // Set CPU2TOCMIPCFLG.IPC3 Flag
#define IPC_CPU2TOCMIPCSET_IPC4    0x10U         // Set CPU2TOCMIPCFLG.IPC4 Flag
#define IPC_CPU2TOCMIPCSET_IPC5    0x20U         // Set CPU2TOCMIPCFLG.IPC5 Flag
#define IPC_CPU2TOCMIPCSET_IPC6    0x40U         // Set CPU2TOCMIPCFLG.IPC6 Flag
#define IPC_CPU2TOCMIPCSET_IPC7    0x80U         // Set CPU2TOCMIPCFLG.IPC7 Flag
#define IPC_CPU2TOCMIPCSET_IPC8    0x100U        // Set CPU2TOCMIPCFLG.IPC8 Flag
#define IPC_CPU2TOCMIPCSET_IPC9    0x200U        // Set CPU2TOCMIPCFLG.IPC9 Flag
#define IPC_CPU2TOCMIPCSET_IPC10   0x400U        // Set CPU2TOCMIPCFLG.IPC10 Flag
#define IPC_CPU2TOCMIPCSET_IPC11   0x800U        // Set CPU2TOCMIPCFLG.IPC11 Flag
#define IPC_CPU2TOCMIPCSET_IPC12   0x1000U       // Set CPU2TOCMIPCFLG.IPC12 Flag
#define IPC_CPU2TOCMIPCSET_IPC13   0x2000U       // Set CPU2TOCMIPCFLG.IPC13 Flag
#define IPC_CPU2TOCMIPCSET_IPC14   0x4000U       // Set CPU2TOCMIPCFLG.IPC14 Flag
#define IPC_CPU2TOCMIPCSET_IPC15   0x8000U       // Set CPU2TOCMIPCFLG.IPC15 Flag
#define IPC_CPU2TOCMIPCSET_IPC16   0x10000U      // Set CPU2TOCMIPCFLG.IPC16 Flag
#define IPC_CPU2TOCMIPCSET_IPC17   0x20000U      // Set CPU2TOCMIPCFLG.IPC17 Flag
#define IPC_CPU2TOCMIPCSET_IPC18   0x40000U      // Set CPU2TOCMIPCFLG.IPC18 Flag
#define IPC_CPU2TOCMIPCSET_IPC19   0x80000U      // Set CPU2TOCMIPCFLG.IPC19 Flag
#define IPC_CPU2TOCMIPCSET_IPC20   0x100000U     // Set CPU2TOCMIPCFLG.IPC20 Flag
#define IPC_CPU2TOCMIPCSET_IPC21   0x200000U     // Set CPU2TOCMIPCFLG.IPC21 Flag
#define IPC_CPU2TOCMIPCSET_IPC22   0x400000U     // Set CPU2TOCMIPCFLG.IPC22 Flag
#define IPC_CPU2TOCMIPCSET_IPC23   0x800000U     // Set CPU2TOCMIPCFLG.IPC23 Flag
#define IPC_CPU2TOCMIPCSET_IPC24   0x1000000U    // Set CPU2TOCMIPCFLG.IPC24 Flag
#define IPC_CPU2TOCMIPCSET_IPC25   0x2000000U    // Set CPU2TOCMIPCFLG.IPC25 Flag
#define IPC_CPU2TOCMIPCSET_IPC26   0x4000000U    // Set CPU2TOCMIPCFLG.IPC26 Flag
#define IPC_CPU2TOCMIPCSET_IPC27   0x8000000U    // Set CPU2TOCMIPCFLG.IPC27 Flag
#define IPC_CPU2TOCMIPCSET_IPC28   0x10000000U   // Set CPU2TOCMIPCFLG.IPC28 Flag
#define IPC_CPU2TOCMIPCSET_IPC29   0x20000000U   // Set CPU2TOCMIPCFLG.IPC29 Flag
#define IPC_CPU2TOCMIPCSET_IPC30   0x40000000U   // Set CPU2TOCMIPCFLG.IPC30 Flag
#define IPC_CPU2TOCMIPCSET_IPC31   0x80000000U   // Set CPU2TOCMIPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCMIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU2TOCMIPCCLR_IPC0    0x1U          // Clear CPU2TOCMIPCFLG.IPC0 Flag
#define IPC_CPU2TOCMIPCCLR_IPC1    0x2U          // Clear CPU2TOCMIPCFLG.IPC1 Flag
#define IPC_CPU2TOCMIPCCLR_IPC2    0x4U          // Clear CPU2TOCMIPCFLG.IPC2 Flag
#define IPC_CPU2TOCMIPCCLR_IPC3    0x8U          // Clear CPU2TOCMIPCFLG.IPC3 Flag
#define IPC_CPU2TOCMIPCCLR_IPC4    0x10U         // Clear CPU2TOCMIPCFLG.IPC4 Flag
#define IPC_CPU2TOCMIPCCLR_IPC5    0x20U         // Clear CPU2TOCMIPCFLG.IPC5 Flag
#define IPC_CPU2TOCMIPCCLR_IPC6    0x40U         // Clear CPU2TOCMIPCFLG.IPC6 Flag
#define IPC_CPU2TOCMIPCCLR_IPC7    0x80U         // Clear CPU2TOCMIPCFLG.IPC7 Flag
#define IPC_CPU2TOCMIPCCLR_IPC8    0x100U        // Clear CPU2TOCMIPCFLG.IPC8 Flag
#define IPC_CPU2TOCMIPCCLR_IPC9    0x200U        // Clear CPU2TOCMIPCFLG.IPC9 Flag
#define IPC_CPU2TOCMIPCCLR_IPC10   0x400U        // Clear CPU2TOCMIPCFLG.IPC10 Flag
#define IPC_CPU2TOCMIPCCLR_IPC11   0x800U        // Clear CPU2TOCMIPCFLG.IPC11 Flag
#define IPC_CPU2TOCMIPCCLR_IPC12   0x1000U       // Clear CPU2TOCMIPCFLG.IPC12 Flag
#define IPC_CPU2TOCMIPCCLR_IPC13   0x2000U       // Clear CPU2TOCMIPCFLG.IPC13 Flag
#define IPC_CPU2TOCMIPCCLR_IPC14   0x4000U       // Clear CPU2TOCMIPCFLG.IPC14 Flag
#define IPC_CPU2TOCMIPCCLR_IPC15   0x8000U       // Clear CPU2TOCMIPCFLG.IPC15 Flag
#define IPC_CPU2TOCMIPCCLR_IPC16   0x10000U      // Clear CPU2TOCMIPCFLG.IPC16 Flag
#define IPC_CPU2TOCMIPCCLR_IPC17   0x20000U      // Clear CPU2TOCMIPCFLG.IPC17 Flag
#define IPC_CPU2TOCMIPCCLR_IPC18   0x40000U      // Clear CPU2TOCMIPCFLG.IPC18 Flag
#define IPC_CPU2TOCMIPCCLR_IPC19   0x80000U      // Clear CPU2TOCMIPCFLG.IPC19 Flag
#define IPC_CPU2TOCMIPCCLR_IPC20   0x100000U     // Clear CPU2TOCMIPCFLG.IPC20 Flag
#define IPC_CPU2TOCMIPCCLR_IPC21   0x200000U     // Clear CPU2TOCMIPCFLG.IPC21 Flag
#define IPC_CPU2TOCMIPCCLR_IPC22   0x400000U     // Clear CPU2TOCMIPCFLG.IPC22 Flag
#define IPC_CPU2TOCMIPCCLR_IPC23   0x800000U     // Clear CPU2TOCMIPCFLG.IPC23 Flag
#define IPC_CPU2TOCMIPCCLR_IPC24   0x1000000U    // Clear CPU2TOCMIPCFLG.IPC24 Flag
#define IPC_CPU2TOCMIPCCLR_IPC25   0x2000000U    // Clear CPU2TOCMIPCFLG.IPC25 Flag
#define IPC_CPU2TOCMIPCCLR_IPC26   0x4000000U    // Clear CPU2TOCMIPCFLG.IPC26 Flag
#define IPC_CPU2TOCMIPCCLR_IPC27   0x8000000U    // Clear CPU2TOCMIPCFLG.IPC27 Flag
#define IPC_CPU2TOCMIPCCLR_IPC28   0x10000000U   // Clear CPU2TOCMIPCFLG.IPC28 Flag
#define IPC_CPU2TOCMIPCCLR_IPC29   0x20000000U   // Clear CPU2TOCMIPCFLG.IPC29 Flag
#define IPC_CPU2TOCMIPCCLR_IPC30   0x40000000U   // Clear CPU2TOCMIPCFLG.IPC30 Flag
#define IPC_CPU2TOCMIPCCLR_IPC31   0x80000000U   // Clear CPU2TOCMIPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCMIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU2TOCMIPCFLG_IPC0    0x1U          // CPU2 to CM IPC0 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC1    0x2U          // CPU2 to CM IPC1 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC2    0x4U          // CPU2 to CM IPC2 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC3    0x8U          // CPU2 to CM IPC3 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC4    0x10U         // CPU2 to CM IPC4 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC5    0x20U         // CPU2 to CM IPC5 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC6    0x40U         // CPU2 to CM IPC6 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC7    0x80U         // CPU2 to CM IPC7 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC8    0x100U        // CPU2 to CM IPC8 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC9    0x200U        // CPU2 to CM IPC9 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC10   0x400U        // CPU2 to CM IPC10 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC11   0x800U        // CPU2 to CM IPC11 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC12   0x1000U       // CPU2 to CM IPC12 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC13   0x2000U       // CPU2 to CM IPC13 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC14   0x4000U       // CPU2 to CM IPC14 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC15   0x8000U       // CPU2 to CM IPC15 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC16   0x10000U      // CPU2 to CM IPC16 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC17   0x20000U      // CPU2 to CM IPC17 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC18   0x40000U      // CPU2 to CM IPC18 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC19   0x80000U      // CPU2 to CM IPC19 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC20   0x100000U     // CPU2 to CM IPC20 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC21   0x200000U     // CPU2 to CM IPC21 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC22   0x400000U     // CPU2 to CM IPC22 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC23   0x800000U     // CPU2 to CM IPC23 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC24   0x1000000U    // CPU2 to CM IPC24 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC25   0x2000000U    // CPU2 to CM IPC25 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC26   0x4000000U    // CPU2 to CM IPC26 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC27   0x8000000U    // CPU2 to CM IPC27 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC28   0x10000000U   // CPU2 to CM IPC28 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC29   0x20000000U   // CPU2 to CM IPC29 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC30   0x40000000U   // CPU2 to CM IPC30 Flag Status
#define IPC_CPU2TOCMIPCFLG_IPC31   0x80000000U   // CPU2 to CM IPC31 Flag Status


//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU2IPCACK register
//
//*************************************************************************************************
#define IPC_CMTOCPU2IPCACK_IPC0    0x1U          // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC0
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC1    0x2U          // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC1
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC2    0x4U          // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC2
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC3    0x8U          // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC3
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC4    0x10U         // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC4
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC5    0x20U         // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC5
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC6    0x40U         // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC6
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC7    0x80U         // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC7
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC8    0x100U        // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC8
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC9    0x200U        // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC9
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC10   0x400U        // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC10
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC11   0x800U        // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC11
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC12   0x1000U       // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC12
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC13   0x2000U       // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC13
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC14   0x4000U       // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC14
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC15   0x8000U       // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC15
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC16   0x10000U      // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC16
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC17   0x20000U      // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC17
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC18   0x40000U      // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC18
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC19   0x80000U      // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC19
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC20   0x100000U     // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC20
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC21   0x200000U     // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC21
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC22   0x400000U     // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC22
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC23   0x800000U     // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC23
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC24   0x1000000U    // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC24
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC25   0x2000000U    // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC25
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC26   0x4000000U    // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC26
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC27   0x8000000U    // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC27
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC28   0x10000000U   // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC28
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC29   0x20000000U   // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC29
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC30   0x40000000U   // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC30
                                                 // bit
#define IPC_CMTOCPU2IPCACK_IPC31   0x80000000U   // Acknowledgement from CM to CPU2TOCMIPCFLG.IPC31
                                                 // bit

